{
  // Mais informações sobre pools de modelos podem ser encontradas aqui: https://minecraft.gamepedia.com/Custom_world_generation#JSON_format_8
  // Sim, os arquivos json worldgen podem ter comentários. O Minecraft faz uma análise "leniente" desses arquivos json.

  // Este é o nome do pool de modelos em si. Costumo apenas colocar o caminho do arquivo e o nome do arquivo aqui com modid.
  "name": "minersdream:run_chunk_ore/start_pool",

  // Aqui você pode listar quantos arquivos nbt ou recursos colocados para gerar.
  // Observe que os recursos colocados precisam de um material de entrada de elemento especial.
  "fallback": "minecraft:empty",

  // Aqui você pode listar quantos arquivos nbt ou recursos colocados para gerar.
  // Observe que os recursos colocados precisam de um material de entrada de elemento especial.
  "elements": [
    {

      // Qual a probabilidade de todos os elementos para este ser escolhido.
      "weight": 1,
      "element": {

        // O Identificador do próprio arquivo nbt da peça da estrutura.
        // Observe que isso verificará automaticamente a pasta 'structures' do arquivo nbt.
        // O caminho final seria parecido com 'resources/data/tutorialmod/structures/chunk_ore.nbt'
        // O bloco Jigsaw na estrutura apontará para side_pool.json para gerar a outra metade da casa.
        "location": "minersdream:chunk_ore",

        // Os arquivos JSON do processador podem ser usados para randomizar ou substituir blocos dinamicamente. Aqui não fazemos nada disso.
        "processors": "minecraft:empty",


        // Se definido como 'terrain_matching', a casa seria deformada para se ajustar à mudança de terreno.
        // Isso é melhor para estradas, então vamos ficar 'rigid' por enquanto.
        "projection": "terrain_matching",

        // O tipo de elemento que estamos gerando. Este é provavelmente o que você deseja.
        // Há 'minecraft:legacy_single_pool_element' mas isso troca o comportamento de
        // Ar e Estrutura Vazio em sua peça, bem como alterar o mecanismo de fixação.
        // É apenas para estruturas Vanilla Jigsaw antigas, então não use. Fique com o não legado.
        "element_type": "minecraft:single_pool_element"
      }
    },
    {
      "weight": 1,
      "element": {

        "location": "minersdream:chunk_ore",
        "processors": "minecraft:empty",
        "projection": "terrain_matching",
        "element_type": "minecraft:single_pool_element"
      }
    }
  ]
}